{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import Libraries\n",
    "from rdflib import Graph\n",
    "import pandas as pd\n",
    "import owlrl"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Functions needed for the saving and the reasoning of the graph\n",
    "\n",
    "def saveGraph(graph, file_output):\n",
    "\n",
    "    graph.serialize(destination=file_output, format='ttl')\n",
    "    print(\"Triples including ontology: '\" + str(len(graph)) + \"'.\")\n",
    "\n",
    "def performReasoning(graph, ontology_file):\n",
    "\n",
    "    print(\"Triples including ontology: '\" + str(len(graph)) + \"'.\")\n",
    "    \n",
    "    #We should load the ontology first\n",
    "    graph.load(ontology_file,  format='ttl') #e.g., format=ttl\n",
    "\n",
    "\n",
    "    #We apply reasoning and expand the graph with new triples \n",
    "    owlrl.DeductiveClosure(owlrl.OWLRL_Semantics, axiomatic_triples=False, datatype_axioms=False).expand(graph)\n",
    "\n",
    "    print(\"Triples after OWL 2 RL reasoning: '\" + str(len(graph)) + \"'.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Initialise a graph\n",
    "g = Graph()\n",
    "\n",
    "# Load the asserted tripples from the KG\n",
    "g.parse(\"cw-data.ttl\", format=\"ttl\")\n",
    "print(\"Loaded '\" + str(len(g)) + \"' triples.\")\n",
    "\n",
    "#perform the reasoning  with the created ontology and save to a new KG in ttl format\n",
    "performReasoning(g,'zdetor.ttl')\n",
    "saveGraph(g, 'cw-data-reasoned.ttl')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loaded '77867' triples.\n"
     ]
    }
   ],
   "source": [
    "# Same as above but skipping the reasoning part (i.e. loaded the ttl after the reasoning)\n",
    "g = Graph()\n",
    "g.parse(\"cw-data-reasoned.ttl\", format=\"ttl\")\n",
    "print(\"Loaded '\" + str(len(g)) + \"' triples.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Subtask SPARQL.2 \n",
    "Return all the details of the restaurants that sell pizzas without tomate (i.e., pizza bianca). Return the results as a CSV file (20%)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "70\n"
     ]
    }
   ],
   "source": [
    "qres = g.query(\n",
    "\"\"\"\n",
    "SELECT ?pizzaName ?description ?name ?addressLine\n",
    "WHERE{\n",
    "        ?pizza a zdetor:Pizza;\n",
    "                zdetor:name ?pizzaName;\n",
    "                zdetor:isMenuItemOf ?restaurant;\n",
    "                zdetor:description ?description.\n",
    "        ?restaurant zdetor:name ?name;\n",
    "                    zdetor:hasAddress [ zdetor:addressLine ?addressLine] .\n",
    "    FILTER (regex(LCASE(?pizzaName), \\\"white\\\") || regex(LCASE(?pizzaName), \\\"bianca\\\") || regex(LCASE(?pizzaName), \\\"bianco\\\") ).\n",
    "#    FILTER NOT EXISTS {\n",
    "#        FILTER regex(?description, \\\"tomato\\\").\n",
    "#    }\n",
    "}\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "print(len(qres))\n",
    "\n",
    "#Single row with one boolean vale\n",
    "temp = []\n",
    "for row in qres:\n",
    "    element = {}\n",
    "    element['name'] = str(row.name)\n",
    "    element['addressLine'] = str(row.addressLine)\n",
    "    element['pizzaName'] = str(row.pizzaName)\n",
    "    element['description'] = str(row.description)\n",
    "    temp.append(element)\n",
    "\n",
    "new_temp = pd.DataFrame(temp)\n",
    "new_temp.to_csv(\"Results_4.csv\")\n",
    "# new_temp"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Subtask SPARQL.3 \n",
    "Return the average prize of a Margherita pizza (20%)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "The average price for the Margherita Pizza is: $12.6\n"
     ]
    }
   ],
   "source": [
    "qres = g.query(\n",
    "\"\"\"\n",
    "SELECT (sum(?price)/count(?pizza) as ?averagePrice)\n",
    "WHERE{\n",
    "        ?pizza  a zdetor:MargheritaPizza;\n",
    "                zdetor:price ?price;\n",
    "                zdetor:isMenuItemOf [ zdetor:hasAddress [ zdetor:addressLine ?addressLine] ] .\n",
    "}\n",
    "#GROUP BY ?pizza ?addressLine\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "print(len(qres))\n",
    "\n",
    "# #Single row with one boolean vale\n",
    "for row in qres:\n",
    "    print(f\"The average price for the Margherita Pizza is: ${str(round(float(row.averagePrice),2))}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Subtask SPARQL.4 \n",
    "Return number of restaurants by city, sorted by state and number of restaurants (20%)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "674\n"
     ]
    }
   ],
   "source": [
    "qres = g.query(\n",
    "\"\"\"\n",
    "SELECT ?cityName ?state (count(?restaurant) as ?num_of_restaurants)\n",
    "WHERE{\n",
    "        ?restaurant a zdetor:Restaurant;\n",
    "                    zdetor:hasAddress ?address .\n",
    "        ?address    zdetor:hasCity ?city .\n",
    "        ?city zdetor:name ?cityName .\n",
    "        \n",
    "        OPTIONAL {?address  zdetor:hasState [ zdetor:name ?state] .}\n",
    "}\n",
    "GROUP BY ?cityName\n",
    "ORDER BY ?state ?cityName\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "print(len(qres))\n",
    "\n",
    "#Single row with one boolean vale\n",
    "temp = []\n",
    "for row in qres:\n",
    "    element = {}\n",
    "    element['num_of_restaurants'] = str(row.num_of_restaurants)\n",
    "    element['cityName'] = str(row.cityName)\n",
    "    element['state'] = str(row.state)\n",
    "    temp.append(element)\n",
    "\n",
    "new_temp = pd.DataFrame(temp)\n",
    "new_temp.to_csv(\"Results_4.csv\")\n",
    "# new_temp"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Subtask SPARQL.5 \n",
    "Return the list of restaurants with missing postcode (20%)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>postCode</th>\n",
       "      <th>restaurant</th>\n",
       "      <th>restaurantName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Baldinelli Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Bertucci's</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Masago</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>La Hacienda Real</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Five Below</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Pizza City</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Two Brothers Deli</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Papa John's Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>San Biagio's Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Milt's Pizza Place Llc</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Ak Diamonds</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Valley Lahvosh Baking</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Villa Rose Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Sir Pizza</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   postCode                                         restaurant  \\\n",
       "0      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "1      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "2      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "3      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "4      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "5      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "6      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "7      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "8      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "9      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "10     None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "11     None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "12     None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "13     None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "\n",
       "            restaurantName  \n",
       "0         Baldinelli Pizza  \n",
       "1               Bertucci's  \n",
       "2                   Masago  \n",
       "3         La Hacienda Real  \n",
       "4               Five Below  \n",
       "5               Pizza City  \n",
       "6        Two Brothers Deli  \n",
       "7        Papa John's Pizza  \n",
       "8       San Biagio's Pizza  \n",
       "9   Milt's Pizza Place Llc  \n",
       "10             Ak Diamonds  \n",
       "11   Valley Lahvosh Baking  \n",
       "12        Villa Rose Pizza  \n",
       "13               Sir Pizza  "
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qres = g.query(\n",
    "\"\"\"\n",
    "SELECT ?restaurant ?restaurantName ?postCode\n",
    "WHERE{\n",
    "        ?restaurant a zdetor:Restaurant;\n",
    "                    zdetor:hasAddress ?address ;\n",
    "                    zdetor:name ?restaurantName .\n",
    "        ?address    zdetor:hasCity ?city .\n",
    "        OPTIONAL {?address  zdetor:postCode ?postCode .}\n",
    "        \n",
    "        FILTER( !bound( ?postCode ) )\n",
    "}\n",
    "\n",
    "\"\"\")\n",
    "\n",
    "print(len(qres))\n",
    "\n",
    "#Single row with one boolean vale\n",
    "temp = []\n",
    "# what = ''\n",
    "# for row in qres:\n",
    "#     element = {}\n",
    "#     what = row\n",
    "#     element['restaurant'] = str(row.restaurant)\n",
    "#     element['restaurantName'] = str(row.restaurantName)\n",
    "#     element['postCode'] = str(row.postCode)\n",
    "#     temp.append(element)\n",
    "    \n",
    "for row in qres:\n",
    "    element = {}\n",
    "    for key in row.labels.keys():\n",
    "        element[key]= row[row.labels[key]]\n",
    "    temp.append(element)\n",
    "\n",
    "new_temp = pd.DataFrame(temp)\n",
    "new_temp.to_csv(\"Results_5.csv\")\n",
    "new_temp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "def returnResults(g, query_string):\n",
    "    qres = g.query(query_string)\n",
    "    \n",
    "    \n",
    "    results = []\n",
    "    for row in qres:\n",
    "        element = {}\n",
    "        for key in row.labels.keys():\n",
    "            element[key]= row[row.labels[key]]\n",
    "        results.append(element)\n",
    "\n",
    "    results = pd.DataFrame(results)\n",
    "    \n",
    "    return len(qres), results\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>postCode</th>\n",
       "      <th>restaurant</th>\n",
       "      <th>restaurantName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Baldinelli Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Bertucci's</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Masago</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>La Hacienda Real</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Five Below</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Pizza City</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Two Brothers Deli</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Papa John's Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>San Biagio's Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Milt's Pizza Place Llc</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Ak Diamonds</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Valley Lahvosh Baking</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Villa Rose Pizza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>None</td>\n",
       "      <td>https://www.city.ac.uk/ds/inm713/zacharias_det...</td>\n",
       "      <td>Sir Pizza</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   postCode                                         restaurant  \\\n",
       "0      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "1      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "2      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "3      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "4      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "5      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "6      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "7      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "8      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "9      None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "10     None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "11     None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "12     None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "13     None  https://www.city.ac.uk/ds/inm713/zacharias_det...   \n",
       "\n",
       "            restaurantName  \n",
       "0         Baldinelli Pizza  \n",
       "1               Bertucci's  \n",
       "2                   Masago  \n",
       "3         La Hacienda Real  \n",
       "4               Five Below  \n",
       "5               Pizza City  \n",
       "6        Two Brothers Deli  \n",
       "7        Papa John's Pizza  \n",
       "8       San Biagio's Pizza  \n",
       "9   Milt's Pizza Place Llc  \n",
       "10             Ak Diamonds  \n",
       "11   Valley Lahvosh Baking  \n",
       "12        Villa Rose Pizza  \n",
       "13               Sir Pizza  "
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_string_5 =\"\"\"\n",
    "SELECT ?restaurant ?restaurantName ?postCode\n",
    "WHERE{\n",
    "        ?restaurant a zdetor:Restaurant;\n",
    "                    zdetor:hasAddress ?address ;\n",
    "                    zdetor:name ?restaurantName .\n",
    "        ?address    zdetor:hasCity ?city .\n",
    "        OPTIONAL {?address  zdetor:postCode ?postCode .}\n",
    "        \n",
    "        FILTER( !bound( ?postCode ) )\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "res_len, results_5 = returnResults(g, query_string_5)\n",
    "print(len(qres))\n",
    "results_5.to_csv(\"Results_5.csv\")\n",
    "\n",
    "results_5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Restaurants that sell pizzas without tomate: 1\n"
     ]
    }
   ],
   "source": [
    "query_string_3 = \"\"\" SELECT (sum(?price)/count(?pizza) as ?averagePrice)\n",
    "WHERE{\n",
    "        ?pizza  a zdetor:MargheritaPizza;\n",
    "                zdetor:price ?price;\n",
    "                zdetor:isMenuItemOf [ zdetor:hasAddress [ zdetor:addressLine ?addressLine] ] .\n",
    "}\n",
    "#GROUP BY ?pizza ?addressLine\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "# #Single row with one boolean vale\n",
    "# for row in qres:\n",
    "#     print(f\"The average price for the Margherita Pizza is: ${str(round(float(row.averagePrice),2))}\")\n",
    "res_len_3, results_3 = returnResults(g, query_string_3)\n",
    "results_3.to_csv(\"Results_3.csv\")\n",
    "print(f\"Restaurants that sell pizzas without tomate: {res_len_3}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "12.6"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "str(round(float(results_3.iloc[0].averagePrice),2))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
